Revit 2027 API
Application.NewProjectPosition Method
Creates a new project position object.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ProjectPosition NewProjectPosition(
	double ew,
	double ns,
	double elevation,
	double angle
)
Public Function NewProjectPosition (
	ew As Double,
	ns As Double,
	elevation As Double,
	angle As Double
) As ProjectPosition
public:
ProjectPosition^ NewProjectPosition(
	double ew,
	double ns,
	double elevation,
	double angle
)
member NewProjectPosition :
        ew : float *
        ns : float *
        elevation : float *
        angle : float -> ProjectPosition
Parameters
ew Double
East to West offset in feet.
ns Double
North to South offset in feet.
elevation Double
Elevation above sea level in feet.
angle Double
Rotation angle away from true north in the range of -PI to +PI.
Return Value
ProjectPosition
Remarks
This object contains offset information and is used by the project location object for setting the project location relative to the site location. Measurements are in feet and radians.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace